Revit 2026 API

# WireSizeInUse Property

---

Get or set whether the size can be used in sizing.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool InUse { get; set; }
```
```vb
Public Property InUse As Boolean
	Get
	Set
```
```cpp
public:
property bool InUse {
	bool get ();
	void set (bool value);
}
```
```fsharp
member InUse : bool with get, set
```

#### Property Value

Boolean

#### Reference

WireSize Class

Autodesk.Revit.DB.Electrical Namespace